cf_billing/Documents/бестИзмененитьРазрядностьОбъемовУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзмененитьРазрядностьОбъемовУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестИндивидуальнаяНастройкаРазрядностиОбъема</xr:Item>
				<xr:Item>InformationRegister.бестОбщаяНастройкаРазрядностиОбъема</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗнаковПослеЗапятой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗнаковПослеЗапятой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестИндивидуальнаяНастройкаРазрядностиОбъема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестИндивидуальнаяНастройкаРазрядностиОбъема</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЗнаковПослеЗапятой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестОбщаяНастройкаРазрядностиОбъема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестОбщаяНастройкаРазрядностиОбъема</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЗнаковПослеЗапятой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>бестИзменениеИндивидуальныхНастроекСезонности_ВозобновлениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменениеИндивидуальныхНастроекСезонности_ОграничениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестОбращения_ОбращениеФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестОбращения_ОбращениеЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНП_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНП_РегистрацияПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНПОбщий_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестРегистрацияПоказанийНПОбщий_РегистрацияПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаЗаключениеДоговора_ЗаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаЗаключениеДоговора_ЗаключениеДополнительногоСоглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаЗаключениеДоговора_РасторжениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаЗаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьДанныеДляДополнительногоРасчета_НегативноеВоздействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьДанныеДляДополнительногоРасчета_ПревышениеПДК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьДанныеДляДополнительногоРасчета_ПрочиеДополнительныеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_АктБездоговорногоПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ЗакрытиеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ЗаменаДоговораУОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ЗаявкаНаЗаключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ОткрытиеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_ПерезаключениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСОбъектами_ЗаменаДоговораУОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСОбъектами_ОтключениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСОбъектами_ПодключениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ВозобновлениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ОграничениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСУслугами_ПодключениеУслугиПослеТП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСДоговором_РегистрацияОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьНомерПломбыПрибораУчета_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьНомерПломбыПрибораУчета_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьНомерПломбыПрибораУчета_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБездоговорногоБезучетногоПотребления_БездоговорноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБездоговорногоБезучетногоПотребления_БезучетноеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктированиеНедопускаЮЛ_АктированиеНедопуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктированиеНедопускаЮЛ_АктированиеДопуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочасоваяВедомость_ПлановоеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочасоваяВедомость_ФактическоеПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененитьРазрядностьОбъемовУслуг_ОбщаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности_ВозвратПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности_ПереносПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_СчетНаОстаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЭЭ_КорректировкаИсправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Исправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписиКнигПродажПокупок_КнигаПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписиКнигПродажПокупок_КнигаПокупок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйДокумент_Пеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВосстановлениеЗадолженности_СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВосстановлениеЗадолженности_ВосстановлениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБанкротства_ПризнаниеБанкротом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияБанкротства_ОтменаБанкротства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеструктуризацияЗадолженности_РегистрацияРеструктуризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеструктуризацияЗадолженности_ОтменаРеструктуризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЭЭ_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетЭЭ_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестУстановитьФормулуРасчетаТочекУчетаНП_НачислениеПоФормуле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестУстановитьФормулуРасчетаТочекУчетаНП_ОтменаНачисленийПоФормуле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности_ПереносВозвратПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/бестИзмененитьРазрядностьОбъемовУслуг/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка Тогда
		бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДляПроведения(),		Движения.бестИндивидуальнаяНастройкаРазрядностиОбъема);
	Иначе
		бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДляПроведения(),		Движения.бестОбщаяНастройкаРазрядностиОбъема);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестИзмененитьРазрядностьОбъемовУслуг.Дата КАК Период,
	|	бестИзмененитьРазрядностьОбъемовУслуг.Организация КАК Организация,
	|	бестИзмененитьРазрядностьОбъемовУслуг.Услуга КАК Услуга,
	|	бестИзмененитьРазрядностьОбъемовУслугДоговоры.Договор КАК Договор,
	|	ЕСТЬNULL(бестИзмененитьРазрядностьОбъемовУслугДоговоры.КоличествоЗнаковПослеЗапятой, бестИзмененитьРазрядностьОбъемовУслуг.КоличествоЗнаковПослеЗапятой) КАК КоличествоЗнаковПослеЗапятой
	|ИЗ
	|	Документ.бестИзмененитьРазрядностьОбъемовУслуг КАК бестИзмененитьРазрядностьОбъемовУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестИзмененитьРазрядностьОбъемовУслуг.Договоры КАК бестИзмененитьРазрядностьОбъемовУслугДоговоры
	|		ПО (бестИзмененитьРазрядностьОбъемовУслугДоговоры.Ссылка = бестИзмененитьРазрядностьОбъемовУслуг.Ссылка)
	|			И (бестИзмененитьРазрядностьОбъемовУслуг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка))
	|ГДЕ
	|	бестИзмененитьРазрядностьОбъемовУслуг.Ссылка = &Ссылка" ;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
